app/controllers/store_controller.rb

SELECT * FROM "products" ORDER BY title
---
  def index
    @counter = increment_index_counter
    @products = Product.find_products_for_sale

SELECT * FROM "products" WHERE ("products"."id" = 0)
---
  def add_to_cart
    reset_index_counter
    product = Product.find(params[:id])